<template>
    <ve-radar :data="chartData" :extend='chartExtend' :settings="chartSettings"></ve-radar>
</template>

<script>
    export default {
        name: "RadarMap",
        data() {
            return {
                chartData: {
                    columns: ['标签', '权重','次数', '男'],
                    rows: [
                        { '标签': '航空', '权重': 500, '次数': 100, '男': 0.5},
                        { '标签': '电商', '权重': 100, '次数': 200, '男': 0.4},
                        { '标签': '互联网', '权重': 200, '次数': 300, '男': 0.5},
                        { '标签': '计算机', '权重': 150, '次数': 500, '男': 0.2},
                        { '标签': '股票', '权重': 150, '次数': 300, '男': 0.7},
                        { '标签': '农业', '权重': 100, '次数': 200, '男': 0.8}
                    ],
                    // columns: ['日期', '访问用户', '下单用户', '下单率'],
                    // rows: [
                    //     { '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
                    //     { '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
                    //     { '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
                    //     { '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
                    //     { '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
                    //     { '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 }
                    // ]
                },
                chartExtend: {
                    'xAxis.0.axisLabel.color': 'white', //x轴文本颜色
                    'yAxis.0.axisLabel.color': 'white', //y轴文本改变颜色
                    legend: {
                        textStyle: {
                            color: 'white',
                        }
                    }
                },
                chartSettings: {
                    // 设置显示的指标维度
                    // dimension: ['标签'],
                    // metrics: ['访问用户', '下单用户', '下单率'],
                    // dataType: { '下单率': 'percent' },
                    // 修改指标名称
                    // labelMap: {
                    //     '日期': 'date',
                    //     '访问用户': 'PV',
                    //     '下单用户': 'Order',
                    //     '下单率': 'orderRate'
                    // }
                }
            }
        }
    }
</script>

<style scoped>

</style>